import pandas as pd
import numpy as np

# 1
data = {
     'Имя': ['Анна', 'Борис', 'Влад', 'Ольга'],
     'Возраст': [25, 34, 41, 28],
     'Город': ['Москва', 'Санкт-Петербург', 'Казань', 'Сочи']
}
df = pd.DataFrame(data)
# Возраст > 30
print(df[df['Возраст'] > 30])
print('*' * 10)

# 2
data = {
     'Имя': ['Анна', 'Борис', 'Влад', 'Ольга', 'Марина', 'Роман', 'Екатерина', 'Виктор', 'Ирина'],
     'Возраст': [25, 34, 41, 28, 19, 20, 36, 41, 38],
     'Город': ['Москва', 'Санкт-Петербург', 'Казань', 'Сочи', 'Санкт-Петербург', 'Москва', 'Санкт-Петербург', 'Казань', 'Сочи']
}
df = pd.DataFrame(data)
# Средний возраст по каждому городу
print(df.groupby('Город')['Возраст'].mean())
print('*' * 10)

# 3
def set_status(age: int):
    return 'Взрослый' if age >= 30 else 'Молодой'

data = {
     'Имя': ['Анна', 'Борис', 'Влад', 'Ольга', 'Марина', 'Роман', 'Екатерина', 'Виктор', 'Ирина'],
     'Возраст': [25, 34, 41, 28, 19, 20, 36, 41, 38],
     'Город': ['Москва', 'Санкт-Петербург', 'Казань', 'Сочи', 'Санкт-Петербург', 'Москва', 'Санкт-Петербург', 'Казань', 'Сочи']
}

df = pd.DataFrame(data)
# Подстановка столбца с классификацией возраста
df['Статус'] = df['Возраст'].apply(set_status)
print(df)
print('*' * 10)

# 4
data = {
    'Имя товара': ['Монитор', np.nan, 'Мышка', 'Клавиатура'],
    'Продажи': [15000, 23000, np.nan, 8000]
}
df = pd.DataFrame(data)
print(df)
print('*' * 10)
# Заполнение пропущенных в продажах
df['Продажи'] = df['Продажи'].fillna(df['Продажи'].mean())
print(df)
print('*' * 10)
# Удаление пропущенных в названии товара
df = df.dropna(subset=['Имя товара'])
print(df)
print('*' * 10)


